In [1]:
import sqlite3 as lite
import pandas as pd


con = lite.connect('Chinook.db')

cur = con.cursor()

chinook = open("chinook-database.sql", encoding='utf8')
cur.executescript(chinook.read())
    
cur.execute('''Select 
    c.LastName, 
    c.FirstName, 
    t.Name, 
    a.Title 
    FROM Customer as c 
    JOIN Track as t 
    JOIN Album as a
    ON a.AlbumID = t.AlbumID
    ORDER BY c.LastName''')
print(cur.fetchone())

('Almeida', 'Roberto', 'For Those About To Rock (We Salute You)', 'For Those About To Rock We Salute You')

In [3]:
df = pd.read_sql_query(
    '''Select 
    c.LastName, 
    c.FirstName, 
    t.Name, 
    a.Title 
    FROM Customer as c 
    JOIN Track as t
    ON t.AlbumID = a.AlbumID
    JOIN Album as a
    ON a.AlbumID = t.AlbumID
    ORDER BY c.LastName''', con)

df.head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,For Those About To Rock (We Salute You),For Those About To Rock We Salute You
1,Almeida,Roberto,Balls to the Wall,Balls to the Wall
2,Almeida,Roberto,Fast As a Shark,Restless and Wild
3,Almeida,Roberto,Restless and Wild,Restless and Wild
4,Almeida,Roberto,Princess of the Dawn,Restless and Wild